In [1]:
import pandas as pd
import numpy as np

In [2]:


data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'Salary': [50000, 60000, 70000]}

df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [4]:
#df = pd.read_csv("data.csv")  # Load a dataset
print(df.head())  # Show first 5 rows
print(df.shape)   # (rows, columns)
print(df.columns) # List of column names

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
(3, 3)
Index(['Name', 'Age', 'Salary'], dtype='object')

In [6]:
print(df['Age'])    # Selecting one column
print(df[['Name', 'Salary']])  # Selecting multiple columns
print(df.iloc[1])   # Selecting the second row (index 1)
print(df.iloc[0:2]) # Selecting first two rows
print(df.iloc[1, 2])  # Row index 1, Column index 2 (Salary of Bob)
print(df.iloc[0:2, 1:3])  # First 2 rows & columns Age and Salary

0    25
1    30
2    35
Name: Age, dtype: int64
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
Name        Bob
Age          30
Salary    60000
Name: 1, dtype: object
    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000
60000
   Age  Salary
0   25   50000
1   30   60000

In [7]:
product={
    "name":["AC","Freeze","Fan"],
    "price":[200,400,9000],
    "quantity":[5,6,7]
}
df=pd.DataFrame(product)
print(df)

     name  price  quantity
0      AC    200         5
1  Freeze    400         6
2     Fan   9000         7

In [11]:
print(df.iloc[0:3,1])

0     200
1     400
2    9000
Name: price, dtype: int64

In [12]:
print(df.iloc[0:2,0:3])

     name  price  quantity
0      AC    200         5
1  Freeze    400         6

In [13]:
print(df.isnull().sum())  # Count missing values in each column

name        0
price       0
quantity    0
dtype: int64

In [14]:
df_cleaned = df.dropna()

In [15]:
df_filled = df.fillna(0)  # Replace NaN with 0

In [16]:
df = df.drop_duplicates()  # Removes duplicate rows

In [18]:
df['price'] = df['price'].astype(float)  # Convert column to float

In [24]:
student_info={
    "name":["Ganga","Imran","Ishan"],
    "rollno":[1,1,np.nan]
}
df1=pd.DataFrame(student_info)
print(df1)

    name  rollno
0  Ganga     1.0
1  Imran     1.0
2  Ishan     NaN

In [25]:
print(df1.isnull().sum())

name      0
rollno    1
dtype: int64

In [30]:
m=df1['rollno'].mean()
print(m)
b=df1.fillna(m)
print(b)

1.0
    name  rollno
0  Ganga     1.0
1  Imran     1.0
2  Ishan     1.0

In [33]:
df1=df1.drop_duplicates()

In [34]:
df1['rollno'] = df1['rollno'].astype(float)
print(df1)

    name  rollno
0  Ganga     1.0
1  Imran     1.0
2  Ishan     NaN